---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimTotalLength
source: html/41220653-536b-cd29-31e6-c394ee5e36b3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimTotalLength Property

"Total Length"

## Syntax (C#)
```csharp
public static ForgeTypeId DimTotalLength { get; }
```